In [4]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import numpy as np
from sqlalchemy import create_engine, types
from sqlalchemy import text

In [5]:
df_1 = pd.read_csv('../data/Cleaned/cleaned_world_marriage.csv')
df_2 = pd.read_csv('../data/Cleaned/cleaned_age_at_marriage_women.csv')
df_3 = pd.read_csv('../data/Cleaned/cleaned_marriage-rate-per-1000-inhabitants.csv')
df_4 = pd.read_csv('../data/Cleaned/cleaned_marriage-rates-in-1990-vs-2020.csv')
df_5 = pd.read_csv('../data/Cleaned/cleaned_share-of-births-outside-marriage.csv')
df_6 = pd.read_csv('../data/Cleaned/cleaned_share-of-men-in-england-and-wales-who-have-ever-married-by-age.csv')
df_7 = pd.read_csv('../data/Cleaned/cleaned_share-of-single-parent-households.csv')
df_8 = pd.read_csv('../data/Cleaned/cleaned_share-of-women-in-england-and-wales-who-have-ever-married-by-age.csv')
df_9 = pd.read_csv('../data/Cleaned/cleaned_unpopulation_dataportal.csv')
df_10 = pd.read_csv('../data/Cleaned/cleaned_countries_1970_2025_un.csv')

In [6]:
df_1.sample(5)

,country,age_group,sex,marital_status,data_process,data_collection_start_year,data_collection_end_year,data_source
104403,Hungary,[15-19],Woman,Divorced,Estimate,1979,1979,UNSD
10302,Azerbaijan,[16-19],Man,Single,Census,1979,1979,National statistics
259192,United States of America,[75+],Woman,Widowed,Estimate,1981,1981,UNSD
173333,Netherlands,[15-19],Man,Single,Census,2011,2011,Eurostat
24503,Bulgaria,[45-49],Woman,Consensual union,Census,1985,1985,UNSD

In [7]:
print(df_1.dtypes)

country                       object
age_group                     object
sex                           object
marital_status                object
data_process                  object
data_collection_start_year     int64
data_collection_end_year       int64
data_source                   object
dtype: object

In [8]:
df_2.sample(5)

            country code  year  mean_age_of_women_at_first_marriage
587      Luxembourg  LUX  2003                             28.20000
203         Czechia  CZE  2008                             27.20000
139           Chile  CHL  2008                             28.08799
691          Norway  NOR  1996                             27.90000
1020  United States  USA  1995                             24.50000

In [9]:
df_2.dtypes

country                                 object
code                                    object
year                                     int64
mean_age_of_women_at_first_marriage    float64
dtype: object

In [10]:
df_3.sample(5)

             country code  year  crude_marriage_rate_marriages_per_1000_people
1315       Lithuania  LTU  1991                                            9.2
2052           Spain  ESP  1968                                            7.0
307            Chile  CHL  2014                                            3.6
1342       Lithuania  LTU  2018                                            7.0
2275  United Kingdom  GBR  1991                                            6.1

In [11]:
df_4.sample(6)

,country,code,year,crude_marriage_rate,crude_marriage_rate_people1,year_1
952,Ireland,IRL,1973,7.4,5.1,1990
1931,South Korea,KOR,1979,9.4,9.3,1990
1759,Romania,ROU,1980,8.2,8.3,1990
1633,Poland,POL,1976,9.5,6.7,1990
934,Iceland,ISL,2016,4.9,4.5,1990
1238,Lithuania,LTU,1981,9.1,9.8,1990

In [12]:
df_4.sample(6)

,country,code,year,crude_marriage_rate,crude_marriage_rate_people1,year_1
1703,Portugal,PRT,1985,6.8,7.2,1990
722,Germany,DEU,1987,6.7,6.5,1990
1638,Poland,POL,1981,9.0,6.7,1990
748,Germany,DEU,2013,4.6,6.5,1990
308,Costa Rica,CRI,1994,6.5,7.5,1990
355,Croatia,HRV,1980,7.2,5.8,1990

In [13]:
df_5.sample(5)

             country code  year  share_of_births_outside_of_marriage
479          Czechia  CZE  1995                                 15.6
504          Czechia  CZE  2020                                 48.5
1386     Netherlands  NLD  1994                                 14.3
373          Croatia  HRV  2009                                 12.9
2067  United Kingdom  GBR  2011                                 47.3

In [14]:
df_6.sample(10)

,sex,year,1900_birthcohort,1920_birthcohort,1940_birthcohort,1960_birthcohort,1970_birthcohort
57,Women,40,82.4,90.5,95.0,85.3,72.0
38,Women,21,14.6,26.1,42.2,31.5,12.7
35,Women,18,0.4,1.6,4.6,4.6,1.3
2,Men,19,0.8,0.6,2.0,2.5,0.7
42,Women,25,48.5,61.8,80.6,60.7,35.2
19,Men,36,86.1,87.6,89.7,74.8,58.3
25,Men,42,90.7,90.6,91.6,79.1,65.8
20,Men,37,87.1,88.4,90.1,75.8,59.8
53,Women,36,79.9,88.9,94.2,83.5,68.2
22,Men,39,88.8,89.5,90.8,77.4,62.6

In [15]:
df_7.sample(10)

        country code  year  share_of_single_parent_households
326     Ireland  IRL  1986                               8.18
29   Azerbaijan  AZE  2006                               9.68
299       India  IND  2006                               6.46
470     Morocco  MAR  2014                               7.28
481     Namibia  NAM  2000                               8.32
606     Senegal  SEN  1988                               3.61
437        Mali  MLI  2012                               5.54
146       Congo  COG  2005                               6.55
665    Tanzania  TZA  1996                               7.66
543    Paraguay  PRY  1982                               7.79

In [16]:
df_8.sample(10)

,sex,year,1900_birthcohort,1920_birthcohort,1940_birthcohort,1960_birthcohort,1970_birthcohort
43,Women,26,55.1,68.3,84.2,65.2,40.1
61,Women,44,84.0,91.3,95.4,86.5,74.1
27,Men,44,91.5,91.1,91.8,80.0,67.5
22,Men,39,88.8,89.5,90.8,77.4,62.6
67,Women,50,85.4,92.0,95.7,87.5,76.3
1,Men,18,0.1,0.1,0.4,0.6,0.1
35,Women,18,0.4,1.6,4.6,4.6,1.3
54,Women,37,80.6,89.4,94.4,84.1,69.4
16,Men,33,81.5,84.1,87.6,70.8,51.1
49,Women,32,75.5,85.8,92.4,79.9,61.0

In [17]:
df_9.sample(5)

,indicatorname,year,country,code,time,variant,sex,age,estimate_method,estimatemethod,value
2019,Currently married (Percent),2024,Sri Lanka,LKA,1973,Median,Female,15-49,2,Interpolation,59.92
4913,Currently married (Percent),2024,"China, Hong Kong SAR",HKG,2011,Median,Female,15-49,2,Interpolation,48.81
7160,Currently married (Percent),2024,Mexico,MEX,2018,Median,Female,15-49,2,Interpolation,55.13
2681,Currently married (Percent),2024,Costa Rica,CRI,2019,Median,Female,15-49,2,Interpolation,42.40
9040,Currently married (Percent),2024,Timor-Leste,TLS,1994,Median,Female,15-49,2,Interpolation,73.24

In [18]:
df_10.sample(8)

,countryorarea,isocode,indicator,year,agegroup,percentage,number,data_process
87707,Oman,512,Married or in-union women,1998,30-34,88.59,48.72,Estimate
140231,United States Virgin Islands,850,Married or in-union women,2002,15-49,43.87,11.85,Estimate
144513,Yemen,887,Married or in-union women,1971,20-24,69.40,205.55,Estimate
64669,Jamaica,388,Married or in-union women,2034,40-44,49.94,61.42,Projection
38164,Equatorial Guinea,226,Married or in-union women,2042,35-39,74.93,59.39,Projection
85463,Montenegro,499,Married or in-union women,2041,15-49,53.45,60.43,Projection
31220,Croatia,191,Married or in-union women,1984,35-39,85.16,129.21,Estimate
37498,El Salvador,222,Married or in-union women,2040,25-29,52.44,129.70,Projection